package com.anche.wechatnew.model.wechat;

public enum ErrorCode {

    code_busy("系统繁忙，此时请开发者稍候再试", -1),
    code_40001("获取access_token时AppSecret错误，或者access_token无效。请开发者认真比对AppSecret的正确性，或查看是否正在为恰当的公众号调用接口", 40001),
    code_40002("不合法的凭证类型", 40002),
    code_40003("不合法的OpenID，请开发者确认OpenID（该用户）是否已关注公众号，或是否是其他公众号的OpenID", 40003),
    code_40004("不合法的媒体文件类型", 40004),
    code_40005("不合法的文件类型", 40005),
    code_40006("不合法的文件大小", 40006),
    code_40007("不合法的媒体文件id", 40007),
    code_40008("不合法的消息类型", 40008),
    code_40009("不合法的图片文件大小", 40009),
    code_40010("不合法的语音文件大小", 40010),
    code_40011("不合法的视频文件大小", 40011),
    code_40012("不合法的缩略图文件大小", 40012),
    code_40013("不合法的AppID，请开发者检查AppID的正确性，避免异常字符，注意大小写", 40013),
    code_40014("不合法的access_token，请开发者认真比对access_token的有效性（如是否过期），或查看是否正在为恰当的公众号调用接口", 40014),
    code_40015("不合法的菜单类型", 40015),
    code_40016("不合法的按钮个数", 40016),
    code_40017("不合法的按钮个数", 40017),
    code_40018("不合法的按钮名字长度", 40018),
    code_40019("不合法的按钮KEY长度", 40019),
    code_40020("不合法的按钮URL长度", 40020),
    code_40021("不合法的菜单版本号", 40021),
    code_40022("不合法的子菜单级数", 40022),
    code_40023("不合法的子菜单按钮个数", 40023),
    code_40024("不合法的子菜单按钮类型", 40024),
    code_40025("不合法的子菜单按钮名字长度", 40025),
    code_40026("不合法的子菜单按钮KEY长度", 40026),
    code_40027("不合法的子菜单按钮URL长度", 40027),
    code_40028("不合法的自定义菜单使用用户", 40028),
    code_40029("不合法的oauth_code", 40029),
    code_40030("不合法的refresh_token", 40030),
    code_40031("不合法的openid列表", 40031),
    code_40032("不合法的openid列表长度", 40032),
    code_40033("不合法的请求字符，不能包含\\u**x格式的字符", 40033),
    code_40035("不合法的参数", 40035),
    code_40038("不合法的请求格式", 40038),
    code_40039("不合法的URL长度", 40039),
    code_40050("不合法的分组id", 40050),
    code_40051("分组名字不合法", 40051),
    code_40060("删除单篇图文时，指定的 article_idx 不合法", 40060),
    code_40117("分组名字不合法", 40117),
    code_40118("media_id大小不合法", 40118),
    code_40119("button类型错误", 40119),
    code_40120("button类型错误", 40120),
    code_40121("不合法的media_id类型", 40121),
    code_40132("微信号不合法", 40132),
    code_40137("不支持的图片格式", 40137),
    code_40155("请勿添加其他公众号的主页链接", 40155),
    code_41001("缺少access_token参数", 41001),
    code_41002("缺少appid参数", 41002),
    code_41003("缺少refresh_token参数", 41003),
    code_41004("缺少secret参数", 41004),
    code_41005("缺少多媒体文件数据", 41005),
    code_41006("缺少media_id参数", 41006),
    code_41007("缺少子菜单数据", 41007),
    code_41008("缺少oauth code", 41008),
    code_41009("缺少openid", 41009),
    code_42001("access_token超时，请检查access_token的有效期，请参考基础支持-获取access_token中，对access_toke", 42001),
    code_42002("refresh_token超时", 42002),
    code_42003("oauth_code超时", 42003),
    code_42007("用户修改微信密码，accesstoken和refreshtoken失效，需要重新授权", 42007),
    code_43001("需要GET请求", 43001),
    code_43002("需要POST请求", 43002),
    code_43003("需要HTTPS请求", 43003),
    code_43004("需要接收者关注", 43004),
    code_43005("需要好友关系", 43005),
    code_43019("需要将接收者从黑名单中移除", 43019),
    code_44001("多媒体文件为空", 44001),
    code_44002("POST的数据包为空", 44002),
    code_44003("图文消息内容为空", 44003),
    code_44004("文本消息内容为空", 44004),
    code_45001("多媒体文件大小超过限制", 45001),
    code_45002("消息内容超过限制", 45002),
    code_45003("标题字段超过限制", 45003),
    code_45004("描述字段超过限制", 45004),
    code_45005("链接字段超过限制", 45005),
    code_45006("图片链接字段超过限制", 45006),
    code_45007("语音播放时间超过限制", 45007),
    code_45008("图文消息超过限制", 45008),
    code_45009("接口调用超过限制", 45009),
    code_45010("创建菜单个数超过限制", 45010),
    code_45011("API调用太频繁，请稍候再试", 45011),
    code_45015("回复时间超过限制", 45015),
    code_45016("系统分组，不允许修改", 45016),
    code_45017("分组名字过长", 45017),
    code_45018("分组数量超过上限", 45018),
    code_45047("客服接口下行条数超过上限", 45047),
    code_46001("不存在媒体数据", 46001),
    code_46002("不存在的菜单版本", 46002),
    code_46003("不存在的菜单数据", 46003),
    code_46004("不存在的用户", 46004),
    code_47001("解析JSON/XML内容错误", 47001),
    code_48001("api功能未授权，请确认公众号已获得该接口，可以在公众平台官网-开发者中心页中查看接口权限", 48001),
    code_48002("粉丝拒收消息（粉丝在公众号选项中，关闭了“接收消息”）", 48002),
    code_48004("api接口被封禁，请登录mp.weixin.qq.com查看详情", 48004),
    code_48005("api禁止删除被自动回复和自定义菜单引用的素材", 48005),
    code_48006("api禁止清零调用次数，因为清零次数达到上限", 48006),
    code_50001("用户未授权该api", 50001),
    code_50002("用户受限，可能是违规后接口被封禁", 50002),
    code_61451("参数错误(invalid parameter)", 61451),
    code_61452("无效客服账号(invalid kf_account)", 61452),
    code_61453("客服帐号已存在(kf_account exsited)", 61453),
    code_61454("客服帐号名长度超过限制(仅允许10个英文字符，不包括@及@后的公众号的微信号)(invalid kf_acount length", 61454),
    code_61455("客服帐号名包含非法字符(仅允许英文+数字)(illegal character in kf_account)", 61455),
    code_61456("客服帐号个数超过限制(10个客服账号)(kf_account count exceeded)", 61456),
    code_61457("无效头像文件类型(invalid file type)", 61457),
    code_61450("系统错误(system error)", 61450),
    code_61500("日期格式错误", 61500),
    code_65301("不存在此menuid对应的个性化菜单", 65301),
    code_65302("没有相应的用户", 65302),
    code_65303("没有默认菜单，不能创建个性化菜单", 65303),
    code_65304("MatchRule信息为空", 65304),
    code_65305("个性化菜单数量受限", 65305),
    code_65306("不支持个性化菜单的帐号", 65306),
    code_65307("个性化菜单信息为空", 65307),
    code_65308("包含没有响应类型的button", 65308),
    code_65309("个性化菜单开关处于关闭状态", 65309),
    code_65310("填写了省份或城市信息，国家信息不能为空", 65310),
    code_65311("填写了城市信息，省份信息不能为空", 65311),
    code_65312("不合法的国家信息", 65312),
    code_65313("不合法的省份信息", 65313),
    code_65314("不合法的城市信息", 65314),
    code_65316("该公众号的菜单设置了过多的域名外跳（最多跳转到3个域名的链接）", 65316),
    code_65317("不合法的URL", 65317),
    code_9001001("POST数据参数不合法", 9001001),
    code_9001002("远端服务不可用", 9001002),
    code_9001003("Ticket不合法", 9001003),
    code_9001004("获取摇周边用户信息失败", 9001004),
    code_9001005("获取商户信息失败", 9001005),
    code_9001006("获取OpenID失败", 9001006),
    code_9001007("上传文件缺失", 9001007),
    code_9001008("上传素材的文件类型不合法", 9001008),
    code_9001009("上传素材的文件尺寸不合法", 9001009),
    code_9001010("上传失败", 9001010),
    code_9001020("帐号不合法", 9001020),
    code_9001021("已有设备激活率低于50%，不能新增设备", 9001021),
    code_9001022("设备申请数不合法，必须为大于0的数字", 9001022),
    code_9001023("已存在审核中的设备ID申请", 9001023),
    code_9001024("一次查询设备ID数量不能超过50", 9001024),
    code_9001025("设备ID不合法", 9001025),
    code_9001026("页面ID不合法", 9001026),
    code_9001027("页面参数不合法", 9001027),
    code_9001028("一次删除页面ID数量不能超过10", 9001028),
    code_9001029("页面已应用在设备中，请先解除应用关系再删除", 9001029),
    code_9001030("一次查询页面ID数量不能超过50", 9001030),
    code_9001031("时间区间不合法", 9001031),
    code_9001032("保存设备与页面的绑定关系参数错误", 9001032),
    code_9001033("门店ID不合法", 9001033),
    code_9001034("设备备注信息过长", 9001034),
    code_9001035("设备申请参数不合法", 9001035),
    code_9001036("查询起始值begin不合法", 9001036);
    // 成员变量
    private String name;
    private int index;

    // 构造方法
    private ErrorCode(String name, int index) {
        this.name = name;
        this.index = index;
    }

    // 普通方法
    public static String getName(int index) {
        for (ErrorCode c : ErrorCode.values()) {
            if (c.getIndex() == index) {
                return c.name;
            }
        }
        return null;
    }

    // get set 方法
    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public int getIndex() {
        return index;
    }

    public void setIndex(int index) {
        this.index = index;
    }

}
